package com.nightfury.movielibrary.service;

import java.util.List;

/**
 * Інтерфейс Service визначає основні операції для роботи з сутностями.
 *
 * @param <T> Тип сутності, яку обробляє сервіс.
 */
public interface Service<T> {

    /**
     * Знаходить сутність за її ідентифікатором.
     *
     * @param id Ідентифікатор сутності.
     * @return Сутність з вказаним ідентифікатором або null, якщо сутність не знайдено.
     */
    T findById(int id);

    /**
     * Знаходить список сутностей за їх іменем.
     *
     * @param name Ім'я або назва сутності.
     * @return Список сутностей з вказаним іменем.
     */
    List<T> findByName(String name);

    /**
     * Видаляє сутність за її ідентифікатором.
     *
     * @param id Ідентифікатор сутності, яку потрібно видалити.
     */
    void delete(int id);

    /**
     * Повертає список всіх сутностей, які зберігаються в сервісі.
     *
     * @return Список всіх сутностей.
     */
    List<T> getAll();
}

